{
  "backend/main.mo": "Empty actor definition for the backend canister.",
  "feature_evidence.json": "Feature evidence report mapping portfolio features to source files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables for light/dark themes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Composes all portfolio sections inside the main layout with a navbar and toaster.",
  "frontend/src/components/ContactForm.tsx": "Contact form with validation, fake async submission, and toast feedback.",
  "frontend/src/components/PortfolioLayout.tsx": "Layout wrapper adding page structure and a footer with attribution.",
  "frontend/src/components/PortfolioNavbar.tsx": "Sticky responsive navbar with smooth-scroll navigation and mobile menu.",
  "frontend/src/components/sections/ContactSection.tsx": "Displays a contact form and contact methods including email, LinkedIn, and GitHub.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with background image, intro text, stats, and buttons that scroll to sections.",
  "frontend/src/components/sections/JourneyTimelineSection.tsx": "Shows a scroll-animated career timeline with milestones and icons.",
  "frontend/src/components/sections/ServicesSection.tsx": "Presents service offerings via ServiceCards and a call‑to‑action button.",
  "frontend/src/components/sections/WorkProjectsSection.tsx": "Wraps and displays the WorkCategoryTabs inside a projects section.",
  "frontend/src/components/ServiceCards.tsx": "Grid of interactive service cards with icons, descriptions, and feature lists.",
  "frontend/src/components/TimelineProgressIndicator.tsx": "Scroll-based vertical progress indicator showing milestone completion.",
  "frontend/src/components/WorkCategoryTabs.tsx": "Renders tabbed website and app category cards with descriptions, counts, and highlights.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login/clear functions, and identity persistence.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Hook that returns whether the user prefers reduced-motion and updates on media query changes.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder hook file since no backend queries are used.",
  "frontend/src/hooks/useScrollReveal.ts": "Hook that applies scroll-based reveal animations using IntersectionObserver, respecting reduced-motion settings.",
  "frontend/src/index.css": "Tailwind base and utility layers plus custom theme variables and scroll‑reveal animation classes.",
  "frontend/src/main.tsx": "App entry point that sets up React, React Query, Internet Identity provider, and global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and theme settings for the project.",
  "project_state.json": "Project metadata describing goals, features, image requirements, and current state for the portfolio build."
}